// Складываем стаканы в пирамидку, где в первом ряду 1 стакан, 
// во втором ряду 2 стакана и так до 100 - го ряда.
// Каждый бокал вмещает одну чашку шампанского.
// Затем в первый верхний бокал наливают немного шампанского.
// Когда самый верхний стакан полон, вся вылитая лишняя жидкость 
// одинаково упадет в стакан сразу слева и справа от него.
// Когда эти бокалы наполнятся, излишки шампанского упадут 
// поровну слева и справа от этих бокалов и так далее. 
// (Из бокала в нижнем ряду излишки шампанского упали на пол.)
// Например, после того, как налита одна чашка шампанского, 
// самый верхний бокал оказывается полным.После того как налиты 
// две чашки шампанского, два бокала второго ряда оказываются 
// наполовину полными.После того, как будут налиты три чашки 
// шампанского, эти две чашки наполняются — всего теперь осталось 
// 3 полных бокала.После того, как налиты четыре чашки шампанского, 
// в третьем ряду средний бокал оказывается наполовину полным, 
// а два внешних бокала — на четверть, как показано на рисунке ниже.
// Теперь, налив несколько чашек шампанского с неотрицательным целым числом, 
// верните, насколько полон j - й бокал в i - й строке(оба i и j имеют индекс 0).
// 799

poured = 1, query_row = 1, query_glass = 1
poured = 2, query_row = 1, query_glass = 1

var champagneTower = function (poured, query_row, query_glass) {

};


console.log(champagneTower(poured, query_row, query_glass))